Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider class provides the creation commands for creating a Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeam typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider.Beam
Gets the creation commands for creating a poly-beam.

Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider.Panel
Gets the creation commands for creating a poly-panel.

Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeamTypeProvider.StripFooting
Gets the creation commands for creating a poly-stripfooting.